var LANGUAGE = {
  "code_snippets": {
    "title": "Фрагменти кôда",
    "description": "Фрагменти кôда су кратки блокови кôда које можете више пута користити у својим програмима. Постоје фрагменти за уобичајене ствари које желите да урадите помоћу MicroPython.",
    "instructions": "Одаберите један од понуђених фрагмената како бисте у програм укључили блок кода.",
    "trigger_heading": "окидач",
    "description_heading": "опис",
    "docs": "креирајте коментар како бисте описали свој кôд",
    "wh": "док је неки услов Тачан, нека се одређени кôд извршава у петљи",
    "with": "нека ствари одређеног имена раде нешто\n",
    "cl": "креирајте нову класу која дефинише понашање новог типа објекта\n",
    "def": "дефинишите и именујте функцију која узима неке аргументе и додајте јој опис ако желите",
    "if": "ако је  неки услов Тачан, уради нешто",
    "ei": "иначе ако је неки други услов Тачан, уради нешто",
    "el": "иначе уради нешто друго",
    "for": "за сваки елемент у колекцији елемената урадите нешто са сваким елементом",
    "try": "покушајте нешто да урадите и бавите се изузецима (грешкама)"
  },
  "alerts": {
    "download": "Сафари има грешку која значи да ће ваш рад бити преузет као неименована датотека. Промените јој име тако да се датотека завршава са .hex. Можете и да користите прегледаче као што су Фајерфокс или Хром који немају такву грешку.",
    "save": "Сафари има грешку која значи да ће ваш рад бити преузет као неименована датотека. Промените јој име тако да се датотека завршава са .py. Можете и да користите прегледаче као што су Фајерфокс или Хром који немају такву грешку.",
    "load_code": "Упс! Кôд не може да се упише у .hex датотеку.",
    "unrecognised_hex": "Ова датотека није препозната",
    "snippets": "Фрагменти су искључени када је укључена библиотека блокова.",
    "error": "Грешка:",
    "empty": "Python датотека је празна.",
    "no_python": "У .hex датотеци није пронађен исправан Python кôд.",
    "no_script": "У .hex датотеци није пронађена Python скрипта.",
    "no_main": "У hex датотеци није пронађена main.py датотека.",
    "cant_add_file": "Датотека се не може додати у систему датотека:",
    "module_added": "Модул \"{{module_name}}\" је додат у систему датотека.",
    "module_out_of_space": "Датотека не може да се дода у систем јер нема  више простора за чување."
  },
  "help": {
    "docs-link": {
      "title": "Погледајте документацију за MicroPython",
      "label": "Документација"
    },
    "support-link": {
      "title": "Потражите подршку за micro:bit уређај на новој картици",
      "label": "Подршка"
    },
    "help-link": {
      "title": "У новој картици отворите помоћ за овај едитор ",
      "label": "Помоћ"
    },
    "issues-link": {
      "title": "У GitHub-у погледајте отворена питања у вези са Python едитором",
      "label": "Праћење проблема"
    },
    "feedback-link": {
      "title": "Пошаљите повратне информације о Python едитору",
      "label": "Пошаљите повратне информације"
    },
    "editor-ver": "Верзија едитора:",
    "mp-ver": "Верзија MicroPython:"
  },
  "confirms": {
    "quit": "Неке ваше промене нису сачуване. Изађите свеједно?",
    "blocks": "Имате несачувани кôд. Коришћење блокова ће променити ваш кôд. Можете изгубити промене. Да ли желите да наставите?",
    "replace_main": "Додавање датотеке main.py замениће кôд у едитору!",
    "replace_file": "Да ли желиш да замениш датотеку \"{{file_name}}\"?",
    "replace_module": "Да ли желиш да замениш модул \"{{module_name}}\"?",
    "download_py_multiple": "Овај пројекат садржи више датотека које неће бити сачуване у овом формату.\nПрепоручујемо да преузмете .hex датотеку која садржи цео ваш пројекат и може се поново учитати у едитор.\n\n Да ли сте сигурни да желите да преузмете само датотеку {{file_name}}?"
  },
  "code": {
    "start": "Овде додајте ваш Python кôд. Нпр."
  },
  "webusb": {
    "err": {
      "update-req": "Потребно је да <a target=\"_blank\" href=\"https://microbit.org/firmware/\"> ажурирате micro:bit фирмвер</a> како бисте могли да користите овај додатак.",
      "update-req-title": "Ажурирајте micro:bit фирмвер",
      "clear-connect": "На овај уређај је повезан још један процес. <br> Затворите све друге картице које можда користе WebUSB (нпр. MakeCode, Python едитор) или искључите па поново прикључите micro:bit пре поновног покушаја.",
      "reconnect-microbit": "Поново повежите свој micro:bit и покушајте поново.",
      "partial-flashing-disable": "Ако се грешке и даље јављају, покушајте да онемогућите Брзи флеш у бета опцијама.",
      "device-disconnected": "Уређај је искључен.",
      "device-bootloader": "Please unplug the micro:bit and connect it again without pressing the reset button.<br>More info:",
      "device-bootloader-title": "micro:bit in MAINTENANCE mode",
      "timeout-error": "Није могуће повезивање са micro:bit.",
      "timeout-error-title": "Connection Timed Out",
      "unavailable": "Помоћу WebUSB-a можете да програмирате свој micro:bit и директно га из едитора повезати на серијску конзолу.<br/>Нажалост, овај прегледач не подржава WebUSB. Препоручујемо Хром прегледач или неки други изведен из њега да бисте користили WebUSB.",
      "find-more": "Сазнајте више"
    },
    "troubleshoot": "Решавање проблема",
    "close": "Затвори",
    "request-repl": "Пошаљи CTRL-C за REPL",
    "request-serial": "Пошаљи CTRL-D за ресетовање",
    "flashing-title": "Преузимање МикроПајтона (MicroPython)",
    "flashing-title-code": "Преузимање кода",
    "flashing-long-msg": "Почетно преузимање (флешовање) кода може да потраје мало дуже, следеће преузимање биће брже.",
    "download": "Преузмите Hex "
  },
  "load": {
    "show-files": "Прикажи датотеке",
    "load-title": "Учитај",
    "instructions": "Превуците и отпустите овде .hex или .py датотеку да бисте је отворили.",
    "submit": "Учитај",
    "save-title": "Сачувај",
    "save-hex": "Преузми Hex датотеку пројекта",
    "save-py": "Преузми Python скрипту",
    "fs-title": "Датотеке",
    "toggle-file": "Или потражите датотеку.",
    "fs-add-file": "Додајте датотеку",
    "hide-files": "Сакрите датотеке",
    "td-filename": "Име датотеке",
    "td-size": "Величина",
    "fs-space-free": "слободно",
    "remove-but": "Уклоните",
    "save-but": "Сачувај",
    "files-title": "Датотеке пројекта",
    "help-button": "Помоћ за датотеке",
    "file-help-text": "У подручју пројектних датотека приказују вам се датотеке које су укључене у ваш програм и ту је могуће додавање или уклањање спољних Пајтон модула и других датотека. Сазнајте више у",
    "help-link": "Документација за помоћ за Python едитор",
    "invalid-file-title": "Неисправан тип датотеке",
    "mpy-warning": "Ова верзија Python едитора не подржава додавање .mpy датотеке.",
    "extension-warning": "Python едитор може да учита само датотеке са екстензијама .hex или .py."
  },
  "languages": {
    "en": {
      "title": "Енглески"
    },
    "zh-CN": {
      "title": "Кинески (поједностављен)"
    },
    "zh-HK": {
      "title": "Кинески (традиционални, Хонг Конг)"
    },
    "zh-TW": {
      "title": "Кинески (традиционални, Тајван)"
    },
    "hr": {
      "title": "Хрватски"
    },
    "pl": {
      "title": "Пољски"
    },
    "es": {
      "title": "Шпански"
    },
    "fr": {
      "title": "French"
    },
    "ko": {
      "title": "Korean"
    },
    "nn": {
      "title": "Norwegian Nynorsk"
    },
    "pt": {
      "title": "Portuguese"
    },
    "sr": {
      "title": "Serbian"
    }
  },
  "static-strings": {
    "buttons": {
      "command-download": {
        "title": "Преузмите .hex датотеку за пребацивање (флешовање) на micro:bit уређај",
        "label": "Преузмите"
      },
      "command-disconnect": {
        "title": "Искључите micro:bit уређај",
        "label": "Прекините везу"
      },
      "command-flash": {
        "title": "Учитајте (флешујте) пројекат директно на micro:bit уређај",
        "label": "Пребаците"
      },
      "command-files": {
        "title": "Учитајте/Сачувајте датотеке",
        "label": "Учитајте/ Сачувајте"
      },
      "command-serial": {
        "title": "Повежите micro:bit путем серијске везе",
        "label": "Отворите серијску везу",
        "title-close": "Затворите серијску везу и вратите се у едитор",
        "label-close": "Затворите серијску везу"
      },
      "command-connect": {
        "title": "Повежите micro:bit уређај",
        "label": "Повежи"
      },
      "command-connecting": {
        "title": "Повезивање са micro:bit уређајем",
        "label": "Повезивање"
      },
      "command-options": {
        "title": "Промените подешавања едитора",
        "label": "Бета опција"
      },
      "command-blockly": {
        "title": "Кликните да бисте креирали кôд помоћу \"blockly\" библиотеке",
        "label": "Blockly"
      },
      "command-snippet": {
        "title": "Кликните за одабир фрагмената (пречице кôда)",
        "label": "Фрагменти"
      },
      "command-help": {
        "title": "Откријте корисне ресурсе",
        "label": "Помоћ"
      },
      "command-language": {
        "title": "Одаберите језик",
        "label": "Језик"
      },
      "command-zoom-in": {
        "title": "Увећати"
      },
      "command-zoom-out": {
        "title": "Умањити"
      }
    },
    "script-name": {
      "label": "Име скрипте"
    },
    "options-dropdown": {
      "autocomplete": "Довршите аутоматски",
      "on-enter": "Притисните тастер Ентер",
      "partial-flashing": "Брзо учитавање",
      "lang-select": "Одаберите језик:",
      "add-language-link": "Додајте језик"
    },
    "text-editor": {
      "aria-label": "текст едитора"
    }
  }
};
